
% Фундаментальные константы
k_B = 1.380 * 1e-23; % [Дж / К] Постоянная Больцмана
mu_B = 927.401 * 1e-27; % [А * м^2] Магнетон Бора
mu_0 = 1.256 * 1e-6; % [Н / А^2] Магнитная постоянная
N_a = 6.022 * 1e23; % [моль^-1] Число Авогадро

% Константы материала
% Используемый материал - железо
T_c = 1043; % [К] Температура Кюри
J = T_c * k_B * log(1 + sqrt(2)) / 2; % [Дж] Обменная энергия
mu_at = 2.22 * mu_B; % [А * м^2] Магнитный момент одной частицы
a = 2.856 * 1e-10; % [м] Параметр решетки
K = 4.8 * 1e4; % [Дж / м^3] Постоянная анизотропии
z = 2; % Число участков в элементарной ячейке: 1 - кубическая, 2 - ОЦК, 4 - ГЦК
A = J * z / a; % [Дж / м] Константа обменной жесткости
sigma_BW = pi * sqrt(A * K); % [Дж / м^2] Удельная энергия доменной стенки
delta = pi * sqrt(A / K); % [м] Толщина доменной стенки
M_mol = 0.056; % [кг / моль] Молярная масса
rho = 7800; % [кг / м^3] Плотность
rho_at = rho * N_a / M_mol; % [1 / м^3] Концентрация частиц
M_mat = rho_at * mu_at; % [А / м] Предельная намагниченность материала
r_c = 9 * sigma_BW / (mu_0 * M_mat^2); % [м] Критический радиус домена (сферического)
r_c / delta; % Отношение размера домена к толщине доменной стенки - должно быть >> 1
V_d = 4 / 3 * pi * r_c^3; % [м^3] Объем одного домена
mu_1 = V_d * M_mat; % [А * м^2] Магнитный момент одного домена
B_s = 4 * J / mu_1 % [Тл] Теоретическая индукция насыщения

% Параметры симуляции
N_x = 100; % Количество частиц по оси X
N_y = 100; % Количество частиц по оси Y
N_Trial = 2; % Количество испытаний на один набор параметров

% Параметры реализуемого расчета
T = 300;
B_max = B_s / 2;
t_max = 1.250;
dt = 0.001;
omega = 2 * pi;
N_It = ceil(t_max / dt);
t_arr = (linspace(0, t_max, N_It))';
B_arr = B_max * sin(omega * t_arr);
E_arr = zeros(N_It, 1);
M_arr = zeros(N_It, 1);


tic
[E_0, S_0, M_0] = Ising_Init(N_x, N_y, J, 1, mu_1);
[E, Accept, M, S] = Ising_Base_Pre(N_x, N_y, J, B_arr(1), mu_1, T, N_Trial, ...
                                   S_0, E_0, M_0);
E_arr(1) = mean(E);
M_arr(1) = mean(M);
for i=2:N_It
    i
    [E, Accept, M, S] = Ising_Base_Pre(N_x, N_y, J, B_arr(i), mu_1, T, N_Trial, ...
                                   S, E(end), M(end));
    E_arr(i) = E(end);
    M_arr(i) = M(end);
end
toc
magnet_arr = M_arr / (N_x * N_y * V_d);
H_arr = B_arr / mu_0 - magnet_arr; 
